{
  "code": "movies",
  "title": "Top Movies",
  "subtitle": "IMDB's Top Ten",
  "icon": "movie",
  "description": "Contains the (roughly) top ten movies by user rating according to IMDB.",
  "attribution": {
    "text": "This page uses material from the respective Wikipedia entries",
    "logo": "https://upload.wikimedia.org/wikipedia/en/thumb/8/80/Wikipedia-logo-v2.svg/1122px-Wikipedia-logo-v2.svg.png"
  },
  "items": [
    {
      "title": "The Shawshank Redemption",
      "description": "The Shawshank Redemption is a 1994 American drama film written and directed by Frank Darabont, based on the 1982 Stephen King novella Rita Hayworth and Shawshank Redemption. It tells the story of banker Andy Dufresne (Tim Robbins), who is sentenced to life in Shawshank State Penitentiary for the murder of his wife and her lover, despite his claims of innocence. Over the following two decades, he befriends a fellow prisoner, contraband smuggler Ellis \"Red\" Redding (Morgan Freeman), and becomes instrumental in a money laundering operation led by the prison warden Samuel Norton (Bob Gunton). William Sadler, Clancy Brown, Gil Bellows, and James Whitmore appear in supporting roles.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/81/ShawshankRedemptionMoviePoster.jpg",
      "externalLink": "https://en.wikipedia.org/wiki/The_Shawshank_Redemption"
    },
    {
      "title": "The Godfather",
      "description": "The Godfather is a 1972 American crime film directed by Francis Ford Coppola and produced by Albert S. Ruddy, based on Mario Puzo's best-selling novel of the same name. It stars Marlon Brando and Al Pacino as the leaders of a fictional New York crime family. The story, spanning 1945 to 1955, chronicles the family under the patriarch Vito Corleone (Brando), focusing on the transformation of Michael Corleone (Pacino) from reluctant family outsider to ruthless mafia boss.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/1c/Godfather_ver1.jpg",
      "externalLink": "https://en.wikipedia.org/wiki/The_Godfather"
    },
    {
      "title": "The Dark Knight",
      "description": "The Dark Knight is a 2008 superhero film directed, produced, and co-written by Christopher Nolan. Featuring the DC Comics character Batman, the film is the second part of Nolan's The Dark Knight Trilogy and a sequel to 2005's Batman Begins, starring an ensemble cast including Christian Bale, Michael Caine, Heath Ledger, Gary Oldman, Aaron Eckhart, Maggie Gyllenhaal and Morgan Freeman. In the film, Bruce Wayne / Batman (Bale), Police Lieutenant James Gordon (Oldman) and District Attorney Harvey Dent (Eckhart) form an alliance to dismantle organized crime in Gotham City, but are menaced by a criminal mastermind known as the Joker (Ledger) who seeks to undermine Batman's influence and create chaos.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/8a/Dark_Knight.jpg",
      "externalLink": "https://en.wikipedia.org/wiki/The_Dark_Knight_(film)"
    },
    {
      "title": "The Godfather: Part II",
      "description": "The Godfather Part II is a 1974 American crime film produced and directed by Francis Ford Coppola from a screenplay co-written with Mario Puzo, starring Al Pacino and Robert De Niro. Partially based on Puzo's 1969 novel The Godfather, the film is both sequel and prequel to The Godfather, presenting parallel dramas: one picks up the 1958 story of Michael Corleone (Pacino), the new Don of the Corleone crime family, protecting the family business in the aftermath of an attempt on his life; the prequel covers the journey of his father, Vito Corleone (De Niro), from his Sicilian childhood to the founding of his family enterprise in New York City.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/03/Godfather_part_ii.jpg",
      "externalLink": "https://en.wikipedia.org/wiki/The_Godfather_Part_II"
    },
    {
      "title": "Avengers: Infinity War",
      "description": "Avengers: Infinity War is a 2018 American superhero film based on the Marvel Comics superhero team the Avengers, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. It is the sequel to 2012's The Avengers and 2015's Avengers: Age of Ultron, and the nineteenth film in the Marvel Cinematic Universe (MCU). The film is directed by Anthony and Joe Russo, written by Christopher Markus and Stephen McFeely, and features an ensemble cast including Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans, Scarlett Johansson, Benedict Cumberbatch, Don Cheadle, Tom Holland, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Anthony Mackie, Sebastian Stan, Danai Gurira, Letitia Wright, Dave Bautista, Zoe Saldana, Josh Brolin, and Chris Pratt. In Avengers: Infinity War, the Avengers and the Guardians of the Galaxy attempt to stop Thanos from amassing the all-powerful Infinity Stones.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/4d/Avengers_Infinity_War_poster.jpg",
      "externalLink": "https://en.wikipedia.org/wiki/Avengers:_Infinity_War"
    },
    {
      "title": "Schindler's List",
      "description": "Schindler's List is a 1993 American historical period drama film directed and co-produced by Steven Spielberg and written by Steven Zaillian. It is based on the novel Schindler's Ark by Australian novelist Thomas Keneally. The film follows Oskar Schindler, a Sudeten German businessman, who saved the lives of more than a thousand mostly Polish-Jewish refugees from the Holocaust by employing them in his factories during World War II. It stars Liam Neeson as Schindler, Ralph Fiennes as SS officer Amon Göth, and Ben Kingsley as Schindler's Jewish accountant Itzhak Stern.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/3/38/Schindler%27s_List_movie.jpg",
      "externalLink": "https://en.wikipedia.org/wiki/Schindler%27s_List"
    },
    {
      "title": "Pulp Fiction",
      "description": "Pulp Fiction is a 1994 American crime film written and directed by Quentin Tarantino, based on a story by Tarantino and Roger Avary, and starring John Travolta, Samuel L. Jackson, Bruce Willis, Ving Rhames, and Uma Thurman. The film tells a few stories of criminal Los Angeles. The film's title refers to the pulp magazines and hardboiled crime novels popular during the mid-20th century, known for their graphic violence and punchy dialogue.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/3/3b/Pulp_Fiction_%281994%29_poster.jpg",
      "externalLink": "https://en.wikipedia.org/wiki/Pulp_Fiction"
    },
    {
      "title": "The Lord of the Rings: The Return of the King",
      "description": "The Lord of the Rings: The Return of the King is a 2003 epic high fantasy adventure film produced, written, and directed by Peter Jackson based on the second and third volumes of J. R. R. Tolkien's The Lord of the Rings. It is the third and final instalment in The Lord of the Rings trilogy, following The Fellowship of the Ring (2001) and The Two Towers (2002), preceding The Hobbit film trilogy (2012–14).",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/9d/Lord_of_the_Rings_-_The_Return_of_the_King.jpg",
      "externalLink": "https://en.wikipedia.org/wiki/The_Lord_of_the_Rings:_The_Return_of_the_King"
    },
    {
      "title": "12 Angry Men",
      "description": "12 Angry Men is a 1957 American courtroom drama film adapted from a teleplay of the same name by Reginald Rose. Written and co-produced by Rose himself and directed by Sidney Lumet, this trial film tells the story of a jury made up of 12 men as they deliberate the conviction or acquittal of a defendant on the basis of reasonable doubt, forcing the jurors to question their morals and values. In the United States, a verdict in most criminal trials by jury must be unanimous. The film is notable for its almost exclusive use of one set: out of 96 minutes of run time, only three minutes take place outside of the jury room.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/91/12_angry_men.jpg",
      "externalLink": "https://en.wikipedia.org/wiki/12_Angry_Men_(1957_film)"
    },
    {
      "title": "The Good, the Bad and the Ugly",
      "description": "The Good, the Bad and the Ugly (Italian: Il buono, il brutto, il cattivo, lit. \"The good, the ugly, the bad\") is a 1966 epic Spaghetti Western film directed by Sergio Leone and starring Clint Eastwood, Lee Van Cleef, and Eli Wallach in their respective title roles. Its screenplay was written by Age & Scarpelli, Luciano Vincenzoni and Leone (with additional screenplay material and dialogue provided by an uncredited Sergio Donati),[2] based on a story by Vincenzoni and Leone. Director of photography Tonino Delli Colli was responsible for the film's sweeping widescreen cinematography, and Ennio Morricone composed the film's score including its main theme. It was an international co-production between Italy, Spain, West Germany and the United States.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/45/Good_the_bad_and_the_ugly_poster.jpg",
      "externalLink": "https://en.wikipedia.org/wiki/The_Good,_the_Bad_and_the_Ugly"
    }
  ]
}
